In [1]:
import pandas as pd
import json
import decimal

with open('../data/players.json', 'r') as f:
    players_data = json.load(f)
players_data
[x["Name"] for x in players_data]

['Adan',
 'Andrey',
 'Artavia',
 'Birrita',
 'Bryan',
 'Charlie',
 'Chris',
 'Cordoba',
 'Dan',
 'Emma',
 'Josue',
 'Marliton',
 'Mauro',
 'Minor',
 'Rolo',
 'Santi',
 'Teclas',
 'Ubilla']

In [2]:
import yaml

with open('../config.yml', 'r') as config_file:
    config = yaml.safe_load(config_file)
players_stats = config['Player Stats']
players_stats

{'Pace': {'Acceleration': 45, 'Sprint Speed': 55},
 'Shooting': {'Position': 15,
  'Finishing': 45,
  'Shot Power': 25,
  'Long Shots': 15},
 'Passing': {'Vision': 30, 'Short Pass': 45, 'Long Pass': 25},
 'Dribbling': {'Agility': 10,
  'Balance': 5,
  'Reactions': 10,
  'Ball Control': 25,
  'Dribbling': 40,
  'Composure': 10},
 'Defending': {'Interceptions': 31,
  'Heading Accuracy': 3,
  'Defence Awareness': 36,
  'Stand Tackle': 30},
 'Physical': {'Jumping': 5, 'Stamina': 40, 'Strength': 40, 'Aggression': 15}}

In [3]:
df = pd.DataFrame.from_records(
        [
            {
                **{
                    stat: round(
                        sum(
                            player["Stats"]["Outfield"][stat][substat]
                            * players_stats[stat][substat]
                            / 100
                            for substat in players_stats[stat]
                        )
                    )
                    for stat in players_stats
                },
                "Name": player["Name"],
            }
            for player in players_data
        ]
    )
df

    Pace  Shooting  Passing  Dribbling  Defending  Physical      Name
0     68        42       50         48         69        67      Adan
1     70        78       64         66         66        71    Andrey
2     70        84       62         77         47        78   Artavia
3     66        70       59         61         72        69   Birrita
4     74        74       67         69         75        71     Bryan
5     60        82       57         55         45        69   Charlie
6     64        74       70         79         78        76     Chris
7     69        75       65         69         53        67   Cordoba
8     63        71       57         60         45        67       Dan
9     84        83       69         84         70        76      Emma
10    40        31       40         31         35        56     Josue
11    67        79       61         66         43        65  Marliton
12    72        46       44         38         38        66     Mauro
13    66        76       73         76         73        68     Minor
14    50        45       46         41         59        66      Rolo
15    72        73       59         66         64        66     Santi
16    80        84       68         80         50        70    Teclas
17    83        85       78         86         74        74    Ubilla

In [4]:
df["Total"] = df.drop(["Name"], axis=1).mean(axis=1)
df.sort_values(by="Total", ascending=False, inplace=True)
# df = df[~df["Name"].isin(["Ubilla", "Emma", "Santi"])]
df

,Pace,Shooting,Passing,Dribbling,Defending,Physical,Name,Total
17,83,85,78,86,74,74,Ubilla,80.000000
9,84,83,69,84,70,76,Emma,77.666667
6,64,74,70,79,78,76,Chris,73.500000
13,66,76,73,76,73,68,Minor,72.000000
16,80,84,68,80,50,70,Teclas,72.000000
4,74,74,67,69,75,71,Bryan,71.666667
2,70,84,62,77,47,78,Artavia,69.666667
1,70,78,64,66,66,71,Andrey,69.166667
15,72,73,59,66,64,66,Santi,66.666667
7,69,75,65,69,53,67,Cordoba,66.333333
3,66,70,59,61,72,69,Birrita,66.166667
11,67,79,61,66,43,65,Marliton,63.500000
5,60,82,57,55,45,69,Charlie,61.333333
8,63,71,57,60,45,67,Dan,60.500000
0,68,42,50,48,69,67,Adan,57.333333
14,50,45,46,41,59,66,Rolo,51.166667
12,72,46,44,38,38,66,Mauro,50.666667
10,40,31,40,31,35,56,Josue,38.833333

In [5]:
df.nlargest(5, 'Pace')

    Pace  Shooting  Passing  Dribbling  Defending  Physical    Name      Total
9     84        83       69         84         70        76    Emma  77.666667
17    83        85       78         86         74        74  Ubilla  80.000000
16    80        84       68         80         50        70  Teclas  72.000000
4     74        74       67         69         75        71   Bryan  71.666667
15    72        73       59         66         64        66   Santi  66.666667

In [6]:
df.nlargest(5, 'Shooting')

,Pace,Shooting,Passing,Dribbling,Defending,Physical,Name,Total
17,83,85,78,86,74,74,Ubilla,80.000000
16,80,84,68,80,50,70,Teclas,72.000000
2,70,84,62,77,47,78,Artavia,69.666667
9,84,83,69,84,70,76,Emma,77.666667
5,60,82,57,55,45,69,Charlie,61.333333

In [7]:
df.nlargest(5, 'Passing')

    Pace  Shooting  Passing  Dribbling  Defending  Physical    Name      Total
17    83        85       78         86         74        74  Ubilla  80.000000
13    66        76       73         76         73        68   Minor  72.000000
6     64        74       70         79         78        76   Chris  73.500000
9     84        83       69         84         70        76    Emma  77.666667
16    80        84       68         80         50        70  Teclas  72.000000

In [8]:
df.nlargest(5, 'Dribbling')

,Pace,Shooting,Passing,Dribbling,Defending,Physical,Name,Total
17,83,85,78,86,74,74,Ubilla,80.000000
9,84,83,69,84,70,76,Emma,77.666667
16,80,84,68,80,50,70,Teclas,72.000000
6,64,74,70,79,78,76,Chris,73.500000
2,70,84,62,77,47,78,Artavia,69.666667

In [9]:
df.nlargest(5, 'Defending')

,Pace,Shooting,Passing,Dribbling,Defending,Physical,Name,Total
6,64,74,70,79,78,76,Chris,73.500000
4,74,74,67,69,75,71,Bryan,71.666667
17,83,85,78,86,74,74,Ubilla,80.000000
13,66,76,73,76,73,68,Minor,72.000000
3,66,70,59,61,72,69,Birrita,66.166667

In [10]:
df.nlargest(5, 'Physical')

,Pace,Shooting,Passing,Dribbling,Defending,Physical,Name,Total
2,70,84,62,77,47,78,Artavia,69.666667
9,84,83,69,84,70,76,Emma,77.666667
6,64,74,70,79,78,76,Chris,73.500000
17,83,85,78,86,74,74,Ubilla,80.000000
4,74,74,67,69,75,71,Bryan,71.666667